"""

Вы продукт-менеджер и в настоящее время возглавляете команду по разработке нового продукта. К сожалению, последняя версия вашего продукта не прошла проверку качества. Поскольку каждая версия разрабатывается на основе предыдущей версии, все версии после сломанной версии тоже сломаны.
Предположим, у вас есть n версий [1, 2, ..., n] и вы хотите найти первую сломанную версию, из-за которой все последующие будут сломаны.
Вам предоставляется bool API isBrokenVersion (версия), который возвращает, является ли версия сломанной. Реализуйте функцию для поиска первой сломанной версии. Вы должны свести к минимуму количество обращений к API.

Пример 1:
Вход: n = 5, bad = 4
Выход: 4
Объяснение:
вызов isBrokenVersion(3) -> false
вызов isBrokenVersion(5) -> true
вызов isBrokenVersion(4) -> true
4 - первая сломанная версия.

Пример 2:
Вход: n = 1, bad = 1
Выход: 1

Ограничения:
1 <= bad <= n <= 231 - 1
Необходимо предоставить анализ сложности по времени и памяти в нотации O.
Реализуйте метод solve и сохраните решение в файле test_2.py

# isBrokenVersion API уже реализован.
# def isBrokenVersion(version: int) -> bool:
def solve(n: int) -> int:
    pass

"""